---
kind: method
id: M:Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs.#ctor
source: html/e5525c0e-3fce-fe7a-c120-89368193ba16.htm
---
# Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs.#ctor Method

Initializes a new instance of the ComboBoxDropDownOpenedEventArgs class

## Syntax (C#)
```csharp
public ComboBoxDropDownOpenedEventArgs()
```